<!--
 * @Descripttion: 
 * @version: v1.0.0
 * @Author: uniobh
 * @Date: 2022-10-08 15:12:35
 * @LastEditTime: 2022-10-26 16:10:31
-->
<template>
  <footer class="footer">
    <main>
      <div class="footer-one">
        <h4>YoHo!!!</h4>
        <p>我们的专业团队时刻在岗，确保软件的正常运营和下载。</p>
      </div>
      <div class="footer-two">
        <h4>联系我们</h4>
        <ul>
          <li>
            <svg
              width="20.000000"
              height="20.000000"
              viewBox="0 0 20 20"
              fill="none"
            >
              <g clip-path="url(#clip34_2)">
                <path
                  d="M14.4965 10.2864C16.5988 10.2864 18.3021 11.9968 18.3021 14.1057C18.3021 16.1208 16.4744 17.8853 14.5833 17.8853L13.6959 17.8853C10.69 17.6357 7.54773 16.3184 5.60149 14.4871C3.3044 12.3257 1.69794 9.01245 1.69794 5.93384C1.69794 3.71118 3.34648 2.1145 5.50356 2.1145C7.60565 2.1145 9.30898 3.82495 9.30898 5.93384C9.30898 7.41895 8.44606 8.64429 7.1273 9.23706C7.57477 9.95801 8.10602 10.6108 8.72107 11.1953C9.42981 11.8682 10.2161 12.4128 11.0404 12.7932C11.5542 11.3057 12.8798 10.2864 14.4965 10.2864Z"
                  fill-rule="evenodd"
                  fill="#FFFFFF"
                />
              </g>
              <defs>
                <clipPath id="clip34_2">
                  <rect width="20.000000" height="20.000000" fill="white" />
                </clipPath>
              </defs>
            </svg>
            <span>123456789011</span>
          </li>
          <li>
            <svg
              width="20.000000"
              height="20.000000"
              viewBox="0 0 20 20"
              fill="none"
            >
              <g clip-path="url(#clip29_52)">
                <path
                  d="M2.92188 3.35547L16.4355 3.35547C17.3574 3.35547 18.1133 4.0918 18.125 4.99414L9.68164 9.62891L1.24023 5C1.24805 4.09375 1.99805 3.35547 2.92188 3.35547ZM1.24023 6.77344L1.23242 14.9688C1.23242 15.8809 1.99219 16.627 2.92188 16.627L16.4355 16.627C17.3652 16.627 18.125 15.8809 18.125 14.9688L18.125 6.76953L9.88086 11.1875C9.75391 11.2559 9.60156 11.2559 9.47656 11.1875L1.24023 6.77344Z"
                  fill-rule="evenodd"
                  fill="#FFFFFF"
                />
              </g>
              <defs>
                <clipPath id="clip29_52">
                  <rect width="20.000000" height="20.000000" fill="white" />
                </clipPath>
              </defs>
            </svg>
            <span>123489@qq.com</span>
          </li>
          <li>
            <svg
              width="20.000000"
              height="20.000000"
              viewBox="0 0 20 20"
              fill="none"
            >
              <g clip-path="url(#clip34_4)">
                <path
                  d="M10 1.25C14.1363 1.25 17.5 4.65381 17.5 8.8374C17.5072 10.7883 16.8468 12.4785 15.5188 13.9075L11.2325 19.3887C10.9219 19.7925 10.5119 19.9954 10.0025 19.9976C9.49307 19.9995 9.08142 19.8 8.76752 19.3987L4.39502 13.8674C3.12781 12.4302 2.49614 10.7537 2.50002 8.8374C2.50002 4.65381 5.86377 1.25 10 1.25ZM13.8175 8.57495C13.8175 6.46753 12.1125 4.75122 10.0175 4.75122C9.00627 4.75122 8.05377 5.15259 7.33876 5.87866C6.59415 6.6311 6.22415 7.53638 6.22876 8.59497C6.23627 10.7024 7.94127 12.4199 10.0275 12.4199C11.0809 12.4255 11.9739 12.0496 12.7063 11.2925C13.4225 10.5674 13.8175 9.6001 13.8175 8.57495ZM12.205 8.57495C12.205 9.16748 11.98 9.71997 11.5713 10.135C11.1485 10.5698 10.6339 10.7869 10.0275 10.7861C8.82002 10.7861 7.84001 9.79883 7.84001 8.58618C7.84001 7.99512 8.06502 7.44116 8.47252 7.02759C8.89752 6.60742 9.44751 6.37622 10.0275 6.37622C10.6113 6.37622 11.1588 6.60376 11.5713 7.02124C11.9838 7.4375 12.21 7.98877 12.205 8.57495Z"
                  fill-rule="evenodd"
                  fill="#FFFFFF"
                />
              </g>
              <defs>
                <clipPath id="clip34_4">
                  <rect width="20.000000" height="20.000000" fill="white" />
                </clipPath>
              </defs>
            </svg>
            <span>湖南省长沙市</span>
          </li>
        </ul>
      </div>
      <div class="footer-three">
        <h4>快速链接</h4>
        <ul>
          <li>
            <svg
              width="20.000000"
              height="20.000000"
              viewBox="0 0 20 20"
              fill="none"
            >
              <g clip-path="url(#clip34_6)">
                <path
                  d="M19.1802 7.89868L11.1977 1.63965C10.5157 1.09863 9.44733 1.09863 8.76532 1.63965L0.843262 7.90186C0.571106 8.11694 0.527466 8.51001 0.739075 8.77881C0.950745 9.04761 1.34717 9.09473 1.61597 8.88306L1.87128 8.6814L1.87128 16.2507C1.87128 17.3225 2.98334 18.1255 3.97778 18.1255L16.4757 18.1255C17.4567 18.1255 18.1186 17.3728 18.1186 16.2507L18.1186 8.66113L18.4008 8.88306C18.515 8.97363 18.6494 9.01733 18.7872 9.01733C18.9719 9.01733 19.1567 8.93677 19.281 8.77881C19.4994 8.50659 19.449 8.11353 19.1802 7.89868ZM11.873 15.5686L11.873 16.8723L10.6232 16.8723L9.37341 16.8723L8.1236 16.8723L8.1236 15.5686L8.1236 13.3748C8.1236 12.6492 8.71155 11.8665 9.99829 11.8665C11.2884 11.8665 11.873 12.6492 11.873 13.3748L11.873 15.5686Z"
                  fill-rule="evenodd"
                  fill="#FFFFFF"
                />
              </g>
              <defs>
                <clipPath id="clip34_6">
                  <rect width="20.000000" height="20.000000" fill="white" />
                </clipPath>
              </defs>
            </svg>
            <span>首页</span>
          </li>
          <li>
            <svg
              width="20.000000"
              height="20.000000"
              viewBox="0 0 20 20"
              fill="none"
            >
              <g clip-path="url(#clip34_8)">
                <path
                  d="M6.64575 17.0586L3.0968 19.8916L2.98663 3.84473C2.98663 1.72217 4.70868 0 6.83093 0L13.5584 0C14.6201 0.000732422 15.5263 0.376221 16.2769 1.12695C17.0274 1.87744 17.4026 2.78345 17.4026 3.84473L17.4026 19.8921L10.1946 14.2258L6.64575 17.0586ZM7.34167 11.022L10.1946 9.03979L13.0476 11.022L12.0369 7.69849L14.8099 5.59668L11.3359 5.52612L10.1946 2.24268L9.05341 5.52612L5.5799 5.59668L8.35291 7.69849L7.34167 11.022Z"
                  fill-rule="evenodd"
                  fill="#FFFFFF"
                />
              </g>
              <defs>
                <clipPath id="clip34_8">
                  <rect width="20.000000" height="20.000000" fill="white" />
                </clipPath>
              </defs>
            </svg>
            <span>推荐</span>
          </li>
        </ul>
      </div>
      <div class="footer-four">
        <img src="~assets/imgs/QR.png" alt="" />
      </div>
    </main>
  </footer>
</template>

<script>
export default {
  name: "YHFooter",
};
</script>

<style lang="scss" scoped>
.footer {
  color: #fff;
  padding: 5rem 2rem 0;
  height: 13rem;
  background: url("~assets/imgs/footer.png");
  background-size: cover;
  border-left: 0.3125rem solid #000;
  border-right: 0.3125rem solid #000;
  main {
    display: flex;
    align-items: flex-start;

    div {
      height: auto;
      h4 {
        margin: 0 0 1.25rem 0;
        height: auto;
      }
      ul {
        height: auto;
        li {
          margin: 0 0 0.625rem 0;
          height: auto;
          svg {
            margin: 0 0.3125rem 0 0;
            width: 1.25rem;
            vertical-align: middle;
          }
        }
      }

      &.footer-one {
        padding: 0 0 0 8rem;
        p {
          line-height: 1.5rem;
          width: 10rem;
          height: auto;
        }
      }

      &.footer-four {
        img {
          width: 6rem;
          height: 6rem;
        }
      }
    }
  }
}

@media screen and (max-width: 760px) {
  .footer {
    padding: 0.625rem 1rem;
    background: #000;

    main {
      div {
        margin: 0 0.3125rem;
        &.footer-one {
          padding: 0;
          p {
            width: auto;
          }
        }
        &.footer-two {
          flex: 180%;
        }
      }
    }
  }
}
</style>